Задача 13: Напишите программу, которая выводит
третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5 78 -> третьей цифры нет 32679 -> 6


Console.WriteLine("Task #13");
Console.Write("Input any number: ");
int anyNumber = Convert.ToInt32(Console.ReadLine());
string anyNumberText = Convert.ToString(anyNumber);
if (anyNumberText.Length > 2){
  Console.WriteLine("third number is -> " + anyNumberText[2]);
}
else {
  Console.WriteLine("-> third number missing");
}

