Задача 15: Напишите программу, которая принимает на 
вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да 7 -> да 1 -> нет

Console.WriteLine("Task #15");
Console.WriteLine(" Input a number of a week's day (1-7) ");
int daynumber = Convert.ToInt32(Console.ReadLine());
if(daynumber == 6 || daynumber == 7)
    {
        Console.WriteLine("It's Weekends --> yes");
    }
else if (daynumber < 1 || daynumber > 7)
    {
        Console.WriteLine("Maximum 7 days in a Week");
    }
else
    {
        Console.WriteLine("It's NOT Weekends --> No");
    }

    