Задача 23

Напишите программу, которая принимает на вход число (N) и 
выдаёт таблицу кубов чисел от 1 до N.

3 -> 1, 8, 27 5 -> 1, 8, 27, 64, 125

 Console.Clear();
Console.WriteLine("Task23");
Console.WriteLine("Insert Number");

int num = Convert.ToInt32(Console.ReadLine());

for(int i = 1; i < num +1  ; i++)
    {
        double cub = Math.Pow(i,3);
        if(i==1)
            {
                Console.Write($"->"); 
            }
        else
        Console.Write($"{cub},"); 
    }

    
